// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет,
// является ли этот день выходным.
Console.Clear();
Console.WriteLine("Добрый день! Определимся с выходными. Введите число дня недели: ");

int x = int.Parse(Console.ReadLine()!);
if (x == 1)
{
    Console.WriteLine("Будний день");
}
else if (x == 2)
{
    Console.WriteLine("Будний день");
}
else if (x == 3)
{
    Console.WriteLine("Будний день");
}
else if (x == 4)
{
    Console.WriteLine("Будний день");
}
else if (x == 5)
{
    Console.WriteLine("Будний день");
}

else if (x == 6)
{
    Console.WriteLine("Выходной");
}
else if (x == 7);
{
    Console.WriteLine("Выходной");
}
